.config/doom/config.org
#+TITLE: Giovanni's Doom Emacs Config
#+AUTHOR: Giovanni Cemin
#+DESCRIPTION: Giovanni's personal Doom Emacs config.
#+STARTUP: showeverything

Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Giovanni Cemin"
      user-mail-address "cemin.giovanni@gmail.com")
#+END_SRC

* ABOUT THIS CONFIG
This is my personal Doom Emacs config file, and it is heavily inspired by
[[https://gitlab.com/dwt1/dotfiles/-/tree/master/.config/doom?ref_type=heads][DistroTube]]'s config file. [[https://github.com/doomemacs/doomemacs][Doom Emacs]] is a configuration framework of GNU Emacs
that includes some extensions and configurations out of the box, e.g., the
“evil” keybindings (Vim keybindings).

I have created this file mainly for myself in the never-ending quest of
mastering Emacs, but also for those who want to explore what is possible with
Emacs. This, connected to the fact I tent to easily forget things, led me
to document everything and include lots of examples, some of which I do not use
anymore, but I leave here for information purposes only.


Here are some additional functions/macros that could help you configure Doom:
- `load!' for loading external *.el files relative to this one
- `use-package!' for configuring packages
- `after!' for running code after a package has loaded
- `add-load-path!' for adding directories to the `load-path', relative to
  this file. Emacs searches the `load-path' when you load packages with
  `require' or `use-package'.
- `map!' for binding new keys

To get information about any of these functions/macros, move the cursor over
the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
This will open documentation for it, including demos of how they are used.

You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
they are implemented.

Remember, you do not need to run 'doom sync' after modifying this file!

* BEACON
Never lose your cursor.  When you scroll, your cursor will shine!
This is a global minor-mode. Turn it on everywhere with:

#+BEGIN_SRC emacs-lisp
(beacon-mode 1)
#+END_SRC

* BOOKMARKS AND BUFFERS
Doom Emacs uses ‘SPC b’ for keybindings related to bookmarks and buffers.

** Bookmarks
[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Bookmarks.html#:~:text=Bookmarks%20are%20somewhat%20like%20registers,were%20reading%20in%20various%20files.][Bookmarks]] are tools that record positions you can jump to, and they persist
automatically from one Emacs session to the next.
E.g. use bookmarks to record where you were reading in various files or
directory positions.

| COMMAND         | DESCRIPTION                            | KEYBINDING |
|-----------------+----------------------------------------+------------|
| list-bookmarks  | /List bookmarks/                         | SPC b L    |
| bookmark-set    | /Set bookmark at point/                  | SPC b m    |
| bookmark-delete | /Delete bookmark/                        | SPC b M    |
| bookmark-save   | /Save current bookmark to bookmark file/ | SPC b w    |

#+BEGIN_SRC emacs-lisp
(setq bookmark-default-file "~/.config/doom/bookmarks")

(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-set
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))
#+END_SRC

** Buffers
[[https://www.gnu.org/software/emacs/manual/html_node/elisp/Buffer-Basics.html#:~:text=Buffers%20in%20Emacs%20editing%20are,See%20Text.][Buffers]] are Lisp objects that contain text (or more generally information)
to be edited and displayed. For example, each time you visit a file, a buffer is
used to hold the file’s text, and each time you invoke Dired, a buffer is used
to hold the directory listing.

[[https://www.emacswiki.org/emacs/IbufferMode][Ibuffer]] is an advanced navigation system for buffers, that allows you to list,
filter, compare your buffers.
In the init file I added /+icons/ which enables file type icons using all-the-icons.

| COMMAND          | DESCRIPTION             | KEYBINDING |
|------------------+-------------------------+------------|
| ibuffer          | /Launch ibuffer/          | SPC b i    |
| switch-to-buffer | Swith to another buffer | SPC b b    |
| kill-buffer      | /Kill current buffer/     | SPC b k    |
| next-buffer      | /Goto next buffer/        | SPC b n    |
| previous-buffer  | /Goto previous buffer/    | SPC b p    |
| save-buffer      | /Save current buffer/     | SPC b s    |

** Global Auto Revert
A buffer can get out of sync with respect to its visited file on disk if that
file is changed by another program. To keep it up to date, you can enable Auto
Revert mode by typing M-x auto-revert-mode, or you can set it to be turned on
globally with 'global-auto-revert-mode'.  I have also turned on Global Auto
Revert on non-file buffers, which is especially useful for 'dired' buffers.

#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
#+END_SRC

** Keybindings within ibuffer mode

| COMMAND                           | DESCRIPTION                            | KEYBINDING |
|-----------------------------------+----------------------------------------+------------|
| ibuffer-mark-forward              | /Mark the buffer/                        | m          |
| ibuffer-unmark-forward            | /Unmark the buffer/                      | u          |
| ibuffer-do-kill-on-deletion-marks | /Kill the marked buffers/                | x          |
| ibuffer-filter-by-content         | /Ibuffer filter by content/              | f c        |
| ibuffer-filter-by-directory       | /Ibuffer filter by directory/            | f d        |
| ibuffer-filter-by-filename        | /Ibuffer filter by filename (full path)/ | f f        |
| ibuffer-filter-by-mode            | /Ibuffer filter by mode/                 | f m        |
| ibuffer-filter-by-name            | /Ibuffer filter by name/                 | f n        |
| ibuffer-filter-disable            | /Disable ibuffer filter/                 | f x        |
| ibuffer-do-kill-lines             | /Hide marked buffers/                    | g h        |
| ibuffer-update                    | /Restore hidden buffers/                 | g H        |

#+begin_src emacs-lisp
(evil-define-key 'normal ibuffer-mode-map
  (kbd "f c") 'ibuffer-filter-by-content
  (kbd "f d") 'ibuffer-filter-by-directory
  (kbd "f f") 'ibuffer-filter-by-filename
  (kbd "f m") 'ibuffer-filter-by-mode
  (kbd "f n") 'ibuffer-filter-by-name
  (kbd "f x") 'ibuffer-filter-disable
  (kbd "g h") 'ibuffer-do-kill-lines
  (kbd "g H") 'ibuffer-update)
#+end_src

* CALENDAR
Let's make a 12-month calendar available so we can have a calendar app that, when
we click on time/date in xmobar, we get a nice 12-month calendar to view.

This is a modification of: http://homepage3.nifty.com/oatu/emacs/calendar.html
See also: https://stackoverflow.com/questions/9547912/emacs-calendar-show-more-than-3-months

#+begin_src emacs-lisp :tangle no
;; https://stackoverflow.com/questions/9547912/emacs-calendar-show-more-than-3-months
(defun dt/year-calendar (&optional year)
  (interactive)
  (require 'calendar)
  (let* (
      (current-year (number-to-string (nth 5 (decode-time (current-time)))))
      (month 0)
      (year (if year year (string-to-number (format-time-string "%Y" (current-time))))))
    (switch-to-buffer (get-buffer-create calendar-buffer))
    (when (not (eq major-mode 'calendar-mode))
      (calendar-mode))
    (setq displayed-month month)
    (setq displayed-year year)
    (setq buffer-read-only nil)
    (erase-buffer)
    ;; horizontal rows
    (dotimes (j 4)
      ;; vertical columns
      (dotimes (i 3)
        (calendar-generate-month
          (setq month (+ month 1))
          year
          ;; indentation / spacing between months
          (+ 5 (* 25 i))))
      (goto-char (point-max))
      (insert (make-string (- 10 (count-lines (point-min) (point-max))) ?\n))
      (widen)
      (goto-char (point-max))
      (narrow-to-region (point-max) (point-max)))
    (widen)
    (goto-char (point-min))
    (setq buffer-read-only t)))

(defun dt/scroll-year-calendar-forward (&optional arg event)
  "Scroll the yearly calendar by year in a forward direction."
  (interactive (list (prefix-numeric-value current-prefix-arg)
                     last-nonmenu-event))
  (unless arg (setq arg 0))
  (save-selected-window
    (if (setq event (event-start event)) (select-window (posn-window event)))
    (unless (zerop arg)
      (let* (
              (year (+ displayed-year arg)))
        (dt/year-calendar year)))
    (goto-char (point-min))
    (run-hooks 'calendar-move-hook)))

(defun dt/scroll-year-calendar-backward (&optional arg event)
  "Scroll the yearly calendar by year in a backward direction."
  (interactive (list (prefix-numeric-value current-prefix-arg)
                     last-nonmenu-event))
  (dt/scroll-year-calendar-forward (- (or arg 1)) event))

(map! :leader
      :desc "Scroll year calendar backward" "<left>" #'dt/scroll-year-calendar-backward
      :desc "Scroll year calendar forward" "<right>" #'dt/scroll-year-calendar-forward)

(defalias 'year-calendar 'dt/year-calendar)
#+end_src

Let's also play around with calfw.
#+begin_src emacs-lisp :tangle no
(use-package! calfw)
(use-package! calfw-org)
#+end_src

* CENTAUR-TABS
To use tabs in Doom Emacs, be sure to uncomment "tabs" in Doom's init.el.
Displays tabs at the top of the window similar to tabbed web browsers such as
Firefox.  I don't actually use tabs in Emacs.  I placed this in my config to help
others who may want tabs.  In the default configuration of Doom Emacs, 'SPC t' is
used for "toggle" keybindings, so I choose 'SPC t c' to toggle centaur-tabs.  The
"g" prefix for keybindings is used for a bunch of evil keybindings in Doom, but
"g" plus the arrow keys were not used, so I thought I would bind those for tab
navigation.  But I did leave the default "g t" and "g T" intact if you prefer to
use those for centaur-tabs-forward/backward.

| COMMAND                     | DESCRIPTION               | KEYBINDING       |
|-----------------------------+---------------------------+------------------|
| centaur-tabs-mode           | /Toggle tabs globally/      | SPC t c          |
| centaur-tabs-local-mode     | /Toggle tabs local display/ | SPC t C          |
| centaur-tabs-forward        | /Next tab/                  | g <right> or g t |
| centaur-tabs-backward       | /Previous tab/              | g <left> or g T  |
| centaur-tabs-forward-group  | /Next tab group/            | g <down>         |
| centaur-tabs-backward-group | /Previous tab group/        | g <up>           |

#+BEGIN_SRC emacs-lisp
(setq centaur-tabs-set-bar 'over
      centaur-tabs-set-icons t
      centaur-tabs-gray-out-icons 'buffer
      centaur-tabs-height 24
      centaur-tabs-set-modified-marker t
      centaur-tabs-style "bar"
      centaur-tabs-modified-marker "•")
(map! :leader
      :desc "Toggle tabs globally" "t c" #'centaur-tabs-mode
      :desc "Toggle tabs local display" "t C" #'centaur-tabs-local-mode)
(evil-define-key 'normal centaur-tabs-mode-map (kbd "g <right>") 'centaur-tabs-forward        ; default Doom binding is 'g t'
                                               (kbd "g <left>")  'centaur-tabs-backward       ; default Doom binding is 'g T'
                                               (kbd "g <down>")  'centaur-tabs-forward-group
                                               (kbd "g <up>")    'centaur-tabs-backward-group)
#+END_SRC

* CLIPPY
Gives us a popup box with "Clippy, the paper clip". You can make him say various
things by calling 'clippy-say' function.  But the more useful functions of clippy
are the two describe functions provided: 'clippy-describe-function' and
'clippy-describe-variable'.  Hit the appropriate keybinding while the point is
over a function/variable to call it.  A popup with helpful clippy will appear,
telling you about the function/variable (using describe-function and
describe-variable respectively).

| COMMAND                  | DESCRIPTION                           | KEYBINDING |
|--------------------------+---------------------------------------+------------|
| clippy-describe-function | /Clippy describes function under point/ | SPC c h f  |
| clippy-describe-variable | /Clippy describes variable under point/ | SPC c h v  |

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("c h" . "Help info from Clippy")
       :desc "Clippy describes function under point" "f" #'clippy-describe-function
       :desc "Clippy describes variable under point" "v" #'clippy-describe-variable))

#+end_src

* DIRED
[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Dired.html][Dired]] is the file manager within Emacs, which shows you listing of directories
inside a buffer. Below I setup some useful keybindings, e.g., for image previews
(peep-dired). Since Doom Emacs does not use 'SPC d' for any of its keybindings,
I have chosen the format of 'SPC d' + 'key'.

In the init file I added /+icons/ which enables file type icons using all-the-icons.

I want to reuse the same window to visit different directories, avoiding the
creation of all those buffers
#+begin_src emacs-lisp
(setq dired-kill-when-opening-new-dired-buffer t)
#+end_src

