.config/doom/config.org
* MINIMAP
A minimap sidebar displaying a smaller version of the current buffer on either
the left or right side. It highlights the currently shown region and updates its
position automatically.  Be aware that this minimap program does not work in Org
documents.  This is not unusual though because I have tried several minimap
programs and none of them can handle Org.

| COMMAND      | DESCRIPTION                               | KEYBINDING |
|--------------+-------------------------------------------+------------|
| minimap-mode | /Toggle minimap-mode/                       | SPC t m    |

#+begin_src emacs-lisp
(setq minimap-window-location 'right)
(map! :leader
      (:prefix ("t" . "toggle")
       :desc "Toggle minimap-mode" "m" #'minimap-mode))
#+end_src

* MODELINE
The modeline is the bottom status bar that appears in Emacs windows.  For more
information on what is available to configure in the Doom modeline, check out:
https://github.com/seagle0128/doom-modeline

#+begin_src emacs-lisp
(set-face-attribute 'mode-line nil :font "JetBrains Mono")
(setq doom-modeline-height 30                 ;; sets modeline height
      doom-modeline-bar-width 5               ;; sets right bar width
      doom-modeline-persp-name t              ;; adds perspective name to modeline
      doom-modeline-persp-icon t              ;; adds folder icon next to persp name
      doom-modeline-icon t                    ;; whether display icons in the mode-line
      doom-modeline-major-mode-color-icon t   ;; whether display the colorful icon for `major-mode'
      )
#+end_src

* MOUSE SUPPORT
Adding mouse support in the terminal version of Emacs.

#+begin_src emacs-lisp
(xterm-mouse-mode 1)
#+end_src
* NAVIGATION
Here some keybindings for a faster navigation.
#+begin_src emacs-lisp
(map! )
#+end_src

* NEOTREE
Neotree is a file tree viewer.  When you open neotree, it jumps to the current
file thanks to neo-smart-open.  The neo-window-fixed-size setting makes the
neotree width be adjustable.  Doom Emacs had no keybindings set for neotree.
Since Doom Emacs uses 'SPC t' for 'toggle' keybindings, I used 'SPC t n' for
toggle-neotree.

| COMMAND        | DESCRIPTION               | KEYBINDING |
|----------------+---------------------------+------------|
| neotree-toggle | /Toggle neotree/            | SPC t n    |
| neotree- dir   | /Open directory in neotree/ | SPC d n    |

#+BEGIN_SRC emacs-lisp :tangle no
(after! neotree
  (setq neo-smart-open t
        neo-window-fixed-size nil))
(after! doom-themes
  (setq doom-neotree-enable-variable-pitch t))
(map! :leader
      :desc "Toggle neotree file viewer" "t n" #'neotree-toggle
      :desc "Open directory in neotree"  "d n" #'neotree-dir)
#+END_SRC

* OPEN SPECIFIC FILES
Keybindings to open files that I work with all the time using the find-file
command, which is the interactive file search that opens with 'C-x C-f' in GNU
Emacs or 'SPC f f' in Doom Emacs.  These keybindings use find-file
non-interactively since we specify exactly what file to open.  The format I use
for these bindings is 'SPC =' plus 'key' since Doom Emacs does not use 'SPC ='.

=NOTE=: Doom Emacs already has a function 'doom/open-private-config' set to the
keybinding 'SPC f p'.  This allows you to open any file in your HOME/.config/doom
directory, so the following keybindings that I created are not really necessary,
but I created this section as an example of how to to create bindings that open
specific files on your system.

| PATH TO FILE                        | DESCRIPTION                 | KEYBINDING |
|-------------------------------------+-----------------------------+------------|
| ~/.config/doom/start.org            | /Edit start.org (start page)/ | SPC = =    |
| ~/Documents/second_brain/agenda.org | /Edit agenda file/            | SPC = a    |
| ~/.config/doom/config.org           | /Edit doom config.org/        | SPC = c    |
| ~/.config/doom/init.el              | /Edit doom init.el/           | SPC = i    |
| ~/.config/doom/packages.el          | /Edit doom packages.el/       | SPC = p    |
| ~/.config/doom/eshell/aliases       | /Edit eshell aliases/         | SPC = e a  |
| ~/.config/doom/eshell/profile       | /Edit eshell profile/         | SPC = e p  |

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("=" . "open file")
       :desc "Edit agenda file"      "=" #'(lambda () (interactive) (find-file "~/.config/doom/start.org"))
       :desc "Edit agenda file"      "a" #'(lambda () (interactive) (find-file "~/Documents/second_brain/agenda.org"))
       :desc "Edit doom config.org"  "c" #'(lambda () (interactive) (find-file "~/.config/doom/config.org"))
       :desc "Edit doom init.el"     "i" #'(lambda () (interactive) (find-file "~/.config/doom/init.el"))
       :desc "Edit doom packages.el" "p" #'(lambda () (interactive) (find-file "~/.config/doom/packages.el"))))
(map! :leader
      (:prefix ("= e" . "open eshell files")
       :desc "Edit eshell aliases"   "a" #'(lambda () (interactive) (find-file "~/.config/doom/eshell/aliases"))
       :desc "Edit eshell profile"   "p" #'(lambda () (interactive) (find-file "~/.config/doom/eshell/profile"))))
#+END_SRC

* ORG MODE
I wrapped most of this block in (after! org).  Without this, my settings might be
evaluated too early, which will result in my settings being overwritten by Doom's
defaults.  I have also enabled org-journal, org-superstar and org-roam by adding
(+journal +pretty +roam2) to the org section of my Doom Emacs init.el.

add keybinding for inserting a link

=NOTE=: I have the location of my Org directory and Roam directory in $HOME/nc/ which is a Nextcloud folder that allows me to instantly sync all of my Org work between my home computer and my office computer.

#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "Org babel tangle" "m B" #'org-babel-tangle)
(add-hook 'org-mode-hook 'auto-fill-mode)
(after! org
  (setq org-directory "~/Documents/second_brain/"
        org-default-notes-file (expand-file-name "notes.org" org-directory)
        org-ellipsis "⤵"
        org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
        org-superstar-itembullet-alist '((?+ . ?➤) (?- . ?✦)) ; changes +/- symbols in item lists
        org-log-done 'time
        org-hide-emphasis-markers t
        ;; ex. of org-link-abbrev-alist in action
        ;; [[arch-wiki:Name_of_Page][Description]]
        org-link-abbrev-alist    ; This overwrites the default Doom org-link-abbrev-list
          '(("google" . "http://www.google.com/search?q=")
            ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
            ("ddg" . "https://duckduckgo.com/?q=")
            ("wiki" . "https://en.wikipedia.org/wiki/"))
        org-table-convert-region-max-lines 20000
        org-todo-keywords        ; This overwrites the default Doom org-todo-keywords
          '((sequence
           "TODO(t)"             ; A task that is ready to be tackled
           "IN-PROGRESS"      ; A started task
           "STUDY(s)"            ; Things to study
           "LECT(l)"             ; Reorder lecture notes
           "PROJ(p)"             ; A project that contains other tasks
           "WAIT(w)"             ; Something is holding up this task
           "|"                   ; The pipe necessary to separate "active" states and "inactive" states
           "DONE(d)"             ; Task has been completed
           "CANCELLED(c)" ))     ; Task has been cancelled
        ))


;; replace dot in todo list
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
                                        ;(use-package org-bullets
                                        ;  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(setq org-emphasis-alist
      '(("*" (bold :foreground "white" :background "grey23"))
        ("/" italic)
        ("_" underline)
        ("=" (bold underline :foreground "OrangeRed"))
        ;;("~" (:foreground "black" :background "gold1"))
        ("~" (bold underline :foreground "gold1"))
        ("+" (:strike-through t))))
                                        ;(add-to-list 'org-emphasis-alist
                                        ;             '("*" (:foreground "white"
                                        ;                    :family "Anonymous Pro, Bold")))
#+END_SRC

** Org-agenda
#+begin_src emacs-lisp
(after! org
  (setq org-agenda-files '("~/Documents/second_brain/agenda.org")))

(setq
   ;; org-fancy-priorities-list '("[A]" "[B]" "[C]")
   ;; org-fancy-priorities-list '("❗" "[B]" "[C]")
   org-fancy-priorities-list '("🟥" "🟧" "🟨")
   org-priority-faces
   '((?A :foreground "#c60004" :weight bold)
     (?B :foreground "#e95d00" :weight bold)
     (?C :foreground "#fadf00" :weight bold))
   org-agenda-block-separator 8411)

(setq org-agenda-custom-commands
      '(("v" "A better agenda view"
         ((tags "PRIORITY=\"A\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "High-priority unfinished tasks:")))
          (tags "PRIORITY=\"B\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Medium-priority unfinished tasks:")))
          (tags "PRIORITY=\"C\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Low-priority unfinished tasks:")))
          (tags "customtag"
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Tasks marked with customtag:")))

          (agenda "")
          (alltodo "")))))
#+end_src

