.config/doom/config.el

(setq minimap-window-location 'right)
(map! :leader
      (:prefix ("t" . "toggle")
       :desc "Toggle minimap-mode" "m" #'minimap-mode))

(set-face-attribute 'mode-line nil :font "JetBrains Mono")
(setq doom-modeline-height 30                 ;; sets modeline height
      doom-modeline-bar-width 5               ;; sets right bar width
      doom-modeline-persp-name t              ;; adds perspective name to modeline
      doom-modeline-persp-icon t              ;; adds folder icon next to persp name
      doom-modeline-icon t                    ;; whether display icons in the mode-line
      doom-modeline-major-mode-color-icon t   ;; whether display the colorful icon for `major-mode'
      )

(xterm-mouse-mode 1)

(map! )

(map! :leader
      (:prefix ("=" . "open file")
       :desc "Edit agenda file"      "=" #'(lambda () (interactive) (find-file "~/.config/doom/start.org"))
       :desc "Edit agenda file"      "a" #'(lambda () (interactive) (find-file "~/Documents/second_brain/agenda.org"))
       :desc "Edit doom config.org"  "c" #'(lambda () (interactive) (find-file "~/.config/doom/config.org"))
       :desc "Edit doom init.el"     "i" #'(lambda () (interactive) (find-file "~/.config/doom/init.el"))
       :desc "Edit doom packages.el" "p" #'(lambda () (interactive) (find-file "~/.config/doom/packages.el"))))
(map! :leader
      (:prefix ("= e" . "open eshell files")
       :desc "Edit eshell aliases"   "a" #'(lambda () (interactive) (find-file "~/.config/doom/eshell/aliases"))
       :desc "Edit eshell profile"   "p" #'(lambda () (interactive) (find-file "~/.config/doom/eshell/profile"))))

(map! :leader
      :desc "Org babel tangle" "m B" #'org-babel-tangle)
(add-hook 'org-mode-hook 'auto-fill-mode)
(after! org
  (setq org-directory "~/Documents/second_brain/"
        org-default-notes-file (expand-file-name "notes.org" org-directory)
        org-ellipsis "⤵"
        org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
        org-superstar-itembullet-alist '((?+ . ?➤) (?- . ?✦)) ; changes +/- symbols in item lists
        org-log-done 'time
        org-hide-emphasis-markers t
        ;; ex. of org-link-abbrev-alist in action
        ;; [[arch-wiki:Name_of_Page][Description]]
        org-link-abbrev-alist    ; This overwrites the default Doom org-link-abbrev-list
          '(("google" . "http://www.google.com/search?q=")
            ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
            ("ddg" . "https://duckduckgo.com/?q=")
            ("wiki" . "https://en.wikipedia.org/wiki/"))
        org-table-convert-region-max-lines 20000
        org-todo-keywords        ; This overwrites the default Doom org-todo-keywords
          '((sequence
           "TODO(t)"             ; A task that is ready to be tackled
           "IN-PROGRESS"      ; A started task
           "STUDY(s)"            ; Things to study
           "LECT(l)"             ; Reorder lecture notes
           "PROJ(p)"             ; A project that contains other tasks
           "WAIT(w)"             ; Something is holding up this task
           "|"                   ; The pipe necessary to separate "active" states and "inactive" states
           "DONE(d)"             ; Task has been completed
           "CANCELLED(c)" ))     ; Task has been cancelled
        ))


;; replace dot in todo list
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
                                        ;(use-package org-bullets
                                        ;  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(setq org-emphasis-alist
      '(("*" (bold :foreground "white" :background "grey23"))
        ("/" italic)
        ("_" underline)
        ("=" (bold underline :foreground "OrangeRed"))
        ;;("~" (:foreground "black" :background "gold1"))
        ("~" (bold underline :foreground "gold1"))
        ("+" (:strike-through t))))
                                        ;(add-to-list 'org-emphasis-alist
                                        ;             '("*" (:foreground "white"
                                        ;                    :family "Anonymous Pro, Bold")))

(after! org
  (setq org-agenda-files '("~/Documents/second_brain/agenda.org")))

(setq
   ;; org-fancy-priorities-list '("[A]" "[B]" "[C]")
   ;; org-fancy-priorities-list '("❗" "[B]" "[C]")
   org-fancy-priorities-list '("🟥" "🟧" "🟨")
   org-priority-faces
   '((?A :foreground "#c60004" :weight bold)
     (?B :foreground "#e95d00" :weight bold)
     (?C :foreground "#fadf00" :weight bold))
   org-agenda-block-separator 8411)

(setq org-agenda-custom-commands
      '(("v" "A better agenda view"
         ((tags "PRIORITY=\"A\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "High-priority unfinished tasks:")))
          (tags "PRIORITY=\"B\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Medium-priority unfinished tasks:")))
          (tags "PRIORITY=\"C\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Low-priority unfinished tasks:")))
          (tags "customtag"
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Tasks marked with customtag:")))

          (agenda "")
          (alltodo "")))))
