.config/doom/config.el

(use-package ox-man)
(use-package ox-gemini)

(setq org-journal-dir "~/Documents/second_brain/journal/"
      org-journal-date-prefix "#+TITLE: Daily Journal\n\n* "
      org-journal-file-format "%Y-%m-%d.org"
      org-journal-date-format "%A, %d %B %Y")

(map! :leader
      (:prefix ("m")
       :desc "Org-insert-structure-template"  "S" #'org-insert-structure-template))

(use-package! org-ref
  :config
  (setq bibtex-completion-bibliography '("~/Documents/second_brain/refs/biblio.bib")
        bibtex-completion-notes-path "~/Documents/second_brain/refs/"
        bibtex-completion-pdf-field "file"
        bibtex-completion-pdf-open-function
        (lambda (fpath)
          (call-process "open" nil 0 nil fpath))))

(use-package! ivy-bibtex
  :after org-ref)

(use-package! org-roam-bibtex
  :after org-roam
  :hook (org-roam-mode . org-roam-bibtex-mode)
  :config
  (require 'org-ref)
  )

(use-package! org-ref-prettify
  :after org-ref
  (add-hook 'org-mode-hook 'org-ref-prettify-mode))

(after! org
  (setq org-roam-directory "~/Documents/second_brain/note/"
        org-roam-graph-viewer "/usr/bin/firefox"))

(map! :leader
      (:prefix ("n r" . "org-roam")
       :desc "Completion at point" "c" #'completion-at-point
       :desc "Find node"           "f" #'org-roam-node-find
       :desc "Show graph"          "g" #'org-roam-graph
       :desc "Insert node"         "i" #'org-roam-node-insert
       :desc "Capture to node"     "n" #'org-roam-capture
       :desc "Toggle roam buffer"  "r" #'org-roam-buffer-toggle))

(map! :leader
      :desc "Switch to perspective NAME"       "." #'persp-switch
      :desc "Switch to buffer in perspective"  "," #'persp-switch-to-buffer
      :desc "Switch to next perspective"       "]" #'persp-next
      :desc "Switch to previous perspective"   "[" #'persp-prev
      :desc "Add a buffer current perspective" "+" #'persp-add-buffer
      :desc "Remove perspective by name"       "-" #'persp-remove-by-name)

(use-package rainbow-mode
  :init
  (add-hook 'org-mode-hook 'rainbow-mode))

(map! :leader
