.config/doom/config.org
* REGISTERS
Emacs registers are compartments where you can save text, rectangles and
positions for later use. The default GNU Emacs keybinding is 'C-x r' + key, and
to make it more user friendly I set it to 'SPC r' + key.

*HOW TO*
- Select some content, copy to the register with 'SPC r c' and select the
  register. To paste the content back into the buffer 'SPC r i' or select the
  register with 'SPC r r' and press RETURN.
- Copy the position to the register with 'SPC r f' and select the register. Jump
  to the position with 'SPC r j' or select the register with 'SPC r r' and press
  RETURN.
- Copy the window configuration to the register with 'SPC r w' and select the
  register. To paste the configuration back into the buffer 'SPC r i' or select
  the register with 'SPC r r' and press RETURN.

| COMMAND                          | DESCRIPTION                      | KEYBINDING |
|----------------------------------+----------------------------------+------------|
| copy-to-register                 | /Copy selection to register/       | SPC r c    |
| number-to-register               | /Store number to register/         | SPC r n    |
| insert-register                  | /Insert contents of register/      | SPC r i    |
| frameset-to-register             | /Frameset (position) to register/  | SPC r f    |
| jump-to-register                 | /Jump to register/                 | SPC r j    |
| counsel-register                 | /Interactively choose a register/  | SPC r r    |
| list-registers                   | /List registers/                   | SPC r l    |
| view-register                    | /View a register/                  | SPC r v    |
| window-configuration-to-register | /Window configuration to register/ | SPC r w    |
| increment-register               | /Increment register/               | SPC r +    |
| point-to-register                | /Point to register/                | SPC r SPC  |

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("r" . "registers")
       :desc "Copy to register" "c" #'copy-to-register
       :desc "Frameset to register" "f" #'frameset-to-register
       :desc "Insert contents of register" "i" #'insert-register
       :desc "Jump to register" "j" #'jump-to-register
       :desc "List registers" "l" #'list-registers
       :desc "Number to register" "n" #'number-to-register
       :desc "Interactively choose a register" "r" #'counsel-register
       :desc "View a register" "v" #'view-register
       :desc "Window configuration to register" "w" #'window-configuration-to-register
       :desc "Increment register" "+" #'increment-register
       :desc "Point to register" "SPC" #'point-to-register))
#+END_SRC

* SHELLS
Settings for the various shells and terminal emulators within Emacs.

| COMMAND             | DESCRIPTION                | KEYBINDING |
|---------------------+----------------------------+------------|
| eshell              | /Launch the eshell/          | SPC e s    |
| +eshell/toggle      | /Toggle eshell popup window/ | SPC e t    |
| counsel-esh-history | /Browse the eshell history/  | SPC e h    |
| +vterm/toggle       | /Toggle vterm popup window/  | SPC v t    |

#+BEGIN_SRC emacs-lisp :tangle no
(setq shell-file-name "/bin/fish"
      vterm-max-scrollback 5000)
(setq eshell-rc-script "~/.config/doom/eshell/profile"
      eshell-aliases-file "~/.config/doom/eshell/aliases"
      eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))
(map! :leader
      :desc "Eshell"                 "e s" #'eshell
      :desc "Eshell popup toggle"    "e t" #'+eshell/toggle
      :desc "Counsel eshell history" "e h" #'counsel-esh-history
      :desc "Vterm popup toggle"     "v t" #'+vterm/toggle)
#+END_SRC

* SOLAIRE
If only certain buffers could be so grossly incandescent. [[https://github.com/hlissner/emacs-solaire-mode][doc]]
Doom installs this package as part of the :ui doom module. No additional
configuration is needed.

#+begin_src emacs-lisp :tangle no
(solaire-global-mode +1)
#+end_src

* SPLITS
I set splits to default to opening on the right using 'prefer-horizontal-split'.
I set a keybinding for 'clone-indirect-buffer-other-window' for when I want to
have the same document in two splits.  The text of the indirect buffer is always
identical to the text of its base buffer; changes made by editing either one are
visible immediately in the other.  But in all other respects, the indirect
buffer and its base buffer are completely separate.  For example, I can fold one
split but other will be unfolded.

#+BEGIN_SRC emacs-lisp
(defun prefer-horizontal-split ()
  (set-variable 'split-height-threshold nil t)
  (set-variable 'split-width-threshold 40 t)) ; make this as low as needed
(add-hook 'markdown-mode-hook 'prefer-horizontal-split)
(map! :leader
      :desc "Clone indirect buffer other window" "b c" #'clone-indirect-buffer-other-window)
#+END_SRC

* START PAGE
Let me customize (see [[https://discourse.doomemacs.org/t/how-to-change-your-splash-screen/57][this]] and [[https://docs.doomemacs.org/v21.12/modules/ui/doom-dashboard/][this]] ) the splash screen.
For more splash images see [[https://github.com/Schievel1/doom-emacs-splash][this]].

#+begin_src emacs-lisp
;;(add-hook! '+doom-dashboard-functions :append
;;  (insert "\n" (+doom-dashboard--center +doom-dashboard--width "$$e^{i \pi} + 1 = 0 $$")))
(setq fancy-splash-image (concat doom-private-dir "./images/stallman.png"))
;; (assoc-delete-all "Open project" +doom-dashboard-menu-sections)
(add-to-list '+doom-dashboard-menu-sections
             '("Add journal entry"
               :icon (nerd-icons-mdicon "nf-md-calendar_plus" :face 'doom-dashboard-menu-title)
               :when (featurep! :lang org +journal)
               :face (:inherit (doom-dashboard-menu-title))
               :action org-journal-new-entry
               ))
(custom-set-faces!
  '(doom-dashboard-banner :foreground "red" :background "#000000" :weight bold)
  '(doom-dashboard-footer :inherit font-lock-constant-face)
  '(doom-dashboard-footer-icon :inherit all-the-icons-red)
  '(doom-dashboard-loaded :inherit font-lock-warning-face)
  '(doom-dashboard-menu-desc :foreground "white")
  '(doom-dashboard-menu-title :inherit font-lock-function-name-face))
#+end_src


As an alternative, I can set a custom start file as "dashboard".
I have added to the 'start-mode-hook' the argument 'read-only-mode'.  This is to
prevent accidental editing of the start file, and to prevent clashes with the
'start-mode' specific keybindings.  You can toggle on/off read-only-mode with
'SPC t r'.

#+begin_src emacs-lisp :tangle no
(setq initial-buffer-choice "~/.config/doom/start.org")

(define-minor-mode start-mode
  "Provide functions for custom start page."
  :lighter " start"
  :keymap (let ((map (make-sparse-keymap)))
          ;;(define-key map (kbd "M-z") 'eshell)
            (evil-define-key 'normal start-mode-map
              (kbd "1") '(lambda () (interactive) (find-file "~/.config/doom/config.org"))
              (kbd "2") '(lambda () (interactive) (find-file "~/.config/doom/init.el"))
              ;; (kbd "3") '(lambda () (interactive) (find-file "~/.config/doom/packages.el"))
              ;; (kbd "4") '(lambda () (interactive) (find-file "~/.config/doom/eshell/aliases"))
              ;; (kbd "5") '(lambda () (interactive) (find-file "~/.config/doom/eshell/profile"))
              )
          map))

(add-hook 'start-mode-hook 'read-only-mode) ;; make start.org read-only; use 'SPC t r' to toggle off read-only.
(provide 'start-mode)
#+end_src
* TREEMACS
[[https://github.com/Alexander-Miller/treemacs][Treemacs]] (also [[https://docs.doomemacs.org/v21.12/modules/ui/treemacs/][this]]) is a file tree viewer, like neotree, but cooler.

When you
open neotree, it jumps to the current
file thanks to neo-smart-open.  The neo-window-fixed-size setting makes the
neotree width be adjustable.  Doom Emacs had no keybindings set for neotree.
Since Doom Emacs uses 'SPC t' for 'toggle' keybindings, I used 'SPC t n' for
toggle-neotree.

| COMMAND        | DESCRIPTION               | KEYBINDING |
|----------------+---------------------------+------------|
| neotree-toggle | /Toggle neotree/            | SPC t n    |
| neotree- dir   | /Open directory in neotree/ | SPC d n    |

#+BEGIN_SRC emacs-lisp :tangle no
(after! treemacs
  (treemacs-follow-mode 1))
(map! :leader
      :desc "Toggle treemacs" "t t" #'+treemacs/toggle)
#+END_SRC

* WINNER MODE
Winner mode has been included with GNU Emacs since version 20.  This is a global
minor mode and, when activated, it allows you to “undo” (and “redo”) changes in
the window configuration with the key commands 'SCP w <left>' and 'SPC w <right>'.

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("w" . "window")
       :desc "Winner redo" "<right>" #'winner-redo
       :desc "Winner undo" "<left>"  #'winner-undo))
#+END_SRC

* ZAP TO CHAR
Emacs provides a 'zap-to-char' command that kills from the current point to a
character.  It is bound to 'M-z' in standard GNU Emacs but since Doom Emacs uses
'SPC' as its leader key and does not have 'SPC z' binded to anything, it just
makes since to use it for 'zap-to-char'.  Note that 'zap-to-char' can be used
with the universal argument 'SPC u' to modify its behavior.  Examples of
'zap-to-char' usage are listed in the table below:

| KEYBINDING                | WHAT IS DOES                                               |
|---------------------------+------------------------------------------------------------|
| SPC z e                   | /deletes all chars to the next occurrence of 'e'/            |
| SPC u 2 SPC z e           | /deletes all chars to the second occurrence of 'e'/          |
| SPC u - SPC z e           | /deletes all chars to the previous occurrence of 'e'/        |
| SPC u - 2 SPC z e         | /deletes all chars to the second previous occurrence of 'e'/ |
| SPC u 1 0 0 SPC u SPC z e | /deletes all chars to the 100th occurrence of 'e'/           |

=TIP=: The universal argument (SPC u) can only take a single integer by default.
If you need to use a multi-digit number (like 100 in the last example in the
table above), then you must terminate the universal argument with another 'SPC u'
after typing the number.

'zap-up-to-char' is an alternative command that does not zap the char specified.
It is binded to 'SPC Z'.  It can also be used in conjunction with the universal
argument 'SPC u' in similar fashion to the the 'zap-to-char' examples above.

=NOTE=:  Vim (evil mode) has similar functionality builtin.  You can delete to
the next occurrence of 'e' by using 'dte' in normal.  To delete to the next
occurrence of 'e' including the 'e', then you would use 'dfe'.  And you can
modify 'dt' and 'df' by prefixing them with numbers, so '2dte' would delete to
the second occurrence of 'e'.

#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "Zap to char"    "z" #'zap-to-char
      :desc "Zap up to char" "Z" #'zap-up-to-char)
#+END_SRC




;; ------ org-roam-ui -------
;; https://github.com/org-roam/org-roam-ui
(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  ;;  :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))

;; custom faces
(custom-set-faces!
  '(la-mia-face :slant italic))

;; custom eshell prompt
;;(setq eshell-prompt-function #'eshell-p10k-prompt-function
;;       eshell-prompt-regexp eshell-p10k-prompt-string)

;; ----- guess-language------
;; (use-package! guess-language         ; Automatically detect language for Flyspell
;;   ;;:after org
;;   ;;  :ensure t
;;   :defer t
;;   :init (add-hook 'text-mode-hook #'guess-language-mode)
;;   ;; :hook (org-mode . guess-language-mode) ; do not want to start automatically
;;   :config
;;   (setq guess-language-langcodes '((en . ("english" "English" "🇬🇧" "English"))
;;                                    (it . ("it" "Italiano" "🇮🇹" "Italiano")))
;;         guess-language-languages '(en it)
;;         guess-language-min-paragraph-length 45))
;;:diminish guess-language-mode)

;; ------ KEYBINDINGS ------
;; New keybindings by me! Yuppi
(with-eval-after-load 'neotree
  (define-key neotree-mode-map (kbd "g") 'neotree-refresh))
